In [1]:
# Missing Data has only 3 options:
# - Keep missing data as NaN if forecatsing method dont mind it
# - Drop missing data entire row, info loss.
# - Fill missing data with best estimated guess(may be via extrapolation)

In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame({'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]})

In [6]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
df.dropna() # will remove the rows having missing data

     A    B  C
0  1.0  5.0  1

In [9]:
df.dropna(axis=1) # will remove the columns having missing data

   C
0  1
1  2
2  3

In [10]:
df.fillna(value = 'my_val')

        A       B  C
0       1       5  1
1       2  my_val  2
2  my_val  my_val  3

In [11]:
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [12]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [13]:
#If you want to fill only some specific column with its mean:

df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64